Revit 2027 API
SelectableInViewFilter(Document, ElementId) Constructor
 Constructs a new instance of an SelectableInViewFilter.
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SelectableInViewFilter(
	Document document,
	ElementId viewId
)
Public Sub New (
	document As Document,
	viewId As ElementId
)
public:
SelectableInViewFilter(
	Document^ document,
	ElementId^ viewId
)
new :
        document : Document *
        viewId : ElementId -> SelectableInViewFilter
Parameters
document Document
 The document that owns the view.
viewId ElementId
 The view id.
Exceptions
Exception | Condition
ArgumentException |  viewId is not a view. -or- viewId is not valid for element iteration, because it has no way of representing drawn elements. Many view templates will fail this check.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SelectableInViewFilter Class
SelectableInViewFilter Overload
Autodesk.Revit.UI.Selection Namespace